{
  "publishedAt": "1st Jan 2022",
  "title": "Cost and Outcomes Analytics (COA) Overview",
  "content": "SDI Analytic's product is called Cost and Outcomes Analytics (COA).  It is a web application designed to help health care professionals (ranging from providers, to managers, analysts, and executives) understand and drive patient value.  At its core, COA provides health care professionals with a patient centered view of true costs on the clinical condition level, over the cycle of care and correlates them to patient outcome, quality and satisfaction measures.  COA is not a cost accounting system and costing does not claim a category on its own. True cost awareness however is fundamental to assessing patient value and driving healthcare transformation and as such, is embedded in a larger, more overarching value proposition. The key differentiator, among many, of the COA product is the complete cycle of delivering information that drives initiatives, which are tracked and proven to drive incremental improvements in quality, outcomes, cost and revenue. With average operating margins for hospitals are at around 2.2% and the healthcare industry is shifting from traditional fee for service models to value-based payment systems, the ability to understand and link clinical and financial outcomes has become critical to the continued success and viability of healthcare systems.  Target users for the COA software application are primarily those best positioned in a health care organization to address this challenge and to drive patient value. As such, it is intended to be used by primarily by front-line managers and providers –those who have the greatest interest in both the quality and outcome of individual patients care as well as the costs associated with delivering that care.  Hospital executives and administrative managers intended to be key users who will be provided views of data that are relevant to their interests in driving improvements in patient value.",
  "featuredImage": "/images/uploads/sdicoa.png"
}
