{
  "publishedAt": "1st Jan 2022",
  "title": "SDI Use Case Example",
  "content": "This update provides one example of several use cases SDI is developing, (based on user entitlements, once they login, they experience specific informaiton and flows depending on credentials, role, etc.) For example, a system user such as a site administrator or data administrator will be presented with administrative controls and features that would be very different from a provider manager.  Across the user manager rolls there will also be certain entitlements and views that will be specific to each user. For example, in this use case, a provider manager would sign in have the privilege of seeing not only costs associated with the care he provided with his patients but the costs and quality that his subordinates are also providing.  The provider manager could also be given more filtering privileges to define and distribute populations that subordinates should be focused on. The core areas of application to which a user can navigate include an information page, the information page will serve the purpose of provided a more complete understanding of the data and other features and enhancements (either deployed or in development) that are relevant to the user (critical information for a user to be aware of includes: Use of costing methods, i.e., a CCR or direct acquisition cost, Known bugs and defects, New features from the most recent release, Information relating to costing and outcomes analytics, Training information relating to the sensitivity of data and the responsible use of this data by users); Dashboards – dashboards are intended to provide a high-level overview of both trend and status for key measures of interest (these dashboards are best created on a foundation of rich analytics and reporting; Data composites; Selection of composites; Selection of desired filter parameters and overview of filter functionality.  The rendering of the chart or composite is something that takes place seamlessly by the user’s selection of the composite and an appropriate filter population to apply. Once the composite renders the user is then able to draw insights he might not have considered. Examples of these insights for this specific example include: Realizing that certain providers are often using more than one device per procedure when the procedure shouldn’t ever require the use of more than one; Realizing that a commonly used drug, “Surjaflow”, is much more expensive than previously thought and that this drug can either be used more sparing or that there might be alternative options which are more cost efficient; Learning that a particular provider is consistently able to keep supply costs to a minimum relative to his/her peers; Realizing that there is greater variation across the providers and that this could be attributed to nuances in the procedures and the types of patients that each provider tends to treat more commonly, a request could be made for additional data which would support greater insight saving of views Composite views, after having interacted with them and after having filter criteria applied to them, can be saved to be referred to later or shared with others.",
  "featuredImage": "/images/uploads/sdiusecase1.png"
}

