{
  "publishedAt"3rd Jan 2022",
  "title": "SDI Product Vision",
  "content": "With average operating margins for hospitals are at around 2.2% and the healthcare industry is shifting from traditional fee for service models to value-based payment systems, the ability to understand and link clinical and financial outcomes has become critical to the continued success and viability of healthcare systems.  Target users for the COA software application are primarily those best positioned in a health care organization to address this challenge and to drive patient value.  As such, it is intended to be used by primarily by front-line managers and providers (those who have the greatest interest in both the quality and outcome of individual patients care) as well as the costs associated with delivering that care.  Hospital executives and administrative managers intended to be key users who will be provided views of data that are relevant to their interests in driving improvements in patient value.  The market defined as Clinical Data Analytics is noisy. SDI is dedicated to developing technology to transcend what cost-based analytics provider offer.  As such, the SDI technology providea strong differentiation to assure that it can obtain a meaningful level of adoption.  While costing is a key part of SDI's technology, it is not “the product definition” but rather something that is embedded in more overarching goals such as the analytics that measure patient value, initiatives that improve efficiencies, and reports that gauge patient satisfaction, outcomes, and the quality of care.  The SDI technology architecture allows for the best representation and presentation of cost through the application according to the data available and a client’s willingness to undertake initiatives to evolve their environments into more meaningful costing. The SDI technology engagea clients in one of three ways: First, by consuming data that has been “pre-costed” by a client’s existing costing systems (I.e., EPSI costs or costs from another costing system). This would be done through a “push methodology”.  Second, by consuming data that has been costed using some or all the COA costing methodologies by the client and which is then pushed to the COA analytics application.  And, third, by embedding all costing computations into the application and allowing these computations to be configured by the client as needed (a pull methodology).  The most light-weight distribution approach for clients with minimal IT/data warehousing support – a significant share of the market.  One of the key drivers of interest in the SDI technology is the ability to move beyond the limitations of cost to charge ratios and RVU based costing methodologies. SDI's flexible approach to the consumption of costing data and its flexible costing methodologies, methodologies that can be applied selectively to get the best representation of data against the data available, can allow for the SDI team to guide an organization into more meaningful cost analytics.  This approach allows for a client to make incremental investments into more meaningful costing in areas where they would reap the greatest return for their organizations.",
  "featuredImage": "/images/uploads/sdivision.png"
}